[
	{
    "id": "Blog-2",
    "title": "My Coding Odyssey: Part 2 - College, Creativity, and the Cloud",
    "snippet": "Navigating engineering college amidst a pandemic, discovering the joy of project development, and venturing into Android apps, AI, and cloud technologies...",
    "longExcerpt": "This second part of my journey details my time at Rajiv Gandhi Institute of Technology. It covers the challenges of online learning, the excitement of core computer science subjects, collaborative projects like a Grocery Billing System, and my foray into Android development, Machine Learning with LinkedIn Learning, LeetCode, AWS, PowerBI, and Docker during breaks and final year projects.",
    "date": "2024-01-16",
    "tags": ["Personal", "Journey", "College", "Projects", "Android", "AI", "Cloud"],
    "imageUrls": [
      "/images/blogs/blog-2/image1.jpg",
	  "/images/blogs/blog-2/image2.png"
    ],
    "estimatedReadingTime": "Est. 9 min read",
    "content": "## Embracing the Unplanned Journey\\n\\nThe path led me to Rajiv Gandhi Institute of Technology for Computer Engineering. It wasn't my first choice, but it marked a new beginning. The initial phase was a whirlwind. Delayed exams and admissions meant the first three semesters were a race to catch up. Online lectures and exams became the new normal, an intense atmosphere indeed. Freshman year was a blur of physics, chemistry, maths, and electrical engineering basics. The only familiar comfort was C Programming, a language I already felt at home with. Despite the academic chaos, I clung to the skills I’d honed during lockdown; every line of code then was a step toward mastery now.\\n\\nAs the second year dawned, we dove into the core of computer science: Data Structures, DBMS, Object-Oriented Programming with Java, and Python. To my surprise, my earlier self-study meant these subjects felt more like a review than a new challenge. While the demanding schedule made acquiring entirely new skills tough, I poured my energy into developing projects. The shift to departmental subjects also meant the end of purely offline lectures, and finally, meeting friends in person whom I’d only known through WhatsApp chats added a much-needed personal dimension to college life. My team and I managed to build a Grocery Shop Billing System and an Airline Ticket Reservation System, drawing heavily on my Java and SQL knowledge. Two years of engineering had flown by, a journey not as planned, but a unique tapestry of unexpected challenges and triumphs nonetheless.\\n\\n##  Unleashing Creativity in a Month-Long Break\\n\\nAfter two intense years, a month-long vacation felt like a breath of fresh air. With a decent grasp of several languages and data structures, I was itching for something new. Android Application Development caught my eye. I started with Google's free resources, which were good, but CodeWithHarry's YouTube playlist on Android development truly unlocked it for me. The course culminated in building a music player app, and with it came a surge of confidence – I could build my own Android apps!\\n\\nWith time still on my hands, I embarked on a personal project: a School App. It was the perfect playground to practice Android development and refresh my Java and database concepts. The thrill of transforming an idea into a functional app was incredibly rewarding. As this project neared completion, our university mandated an academic project. After discussions with our guide, we settled on a Timetable Generator. It sounded straightforward, but oh, how wrong we were! What we initially brushed off as a routine task quickly revealed its complexity. The more we researched, the more we realized that timetable generation is an NP-Hard problem. Undeterred, we dove into AI and discovered the Genetic Algorithm. The project transformed from a simple task into an exploration of AI, blending our coding skills with an algorithm that mimicked natural selection. It was a profound lesson in embracing complexity and finding innovative solutions.\\n\\n## Unleashing the Power of Learning\\n\\nAnother month-long break, another learning adventure! This time, Machine Learning was the target. LinkedIn, with its six months of free premium access for students, became an invaluable resource. The premium membership unlocked a treasure trove of courses in AI and ML. As college resumed, our ambitious timetable generator project continued. However, with on-campus recruitment looming next semester, I knew I had to sharpen my problem-solving skills. Enter LeetCode. I committed to solving at least one problem daily. It wasn't always easy; some problems felt like climbing a mountain. Aryan Mittal's YouTube channel often provided the solutions and clarity I needed for those tricky daily puzzles.\\n\\nAcademically, the semester introduced cloud computing, with a focus on AWS. We instantiated EC2 instances and deployed projects using Elastic Beanstalk – a practical introduction to the cloud. The third year ended, and another break began. I dived into Udemy for PowerBI, then Freecodecamp’s YouTube channel for an incredible Docker course. My final year saw the start of my Major Project, 'SimplifyMe', and further explorations into blockchain and machine learning. I also added JavaScript and NodeJS to my expanding skillset.\\n\\nAnd now, here I am, on the verge of a new chapter, eager for opportunities as a Software Engineer. This journey, a rollercoaster of learning, challenges, and growth, has equipped me with a unique perspective and a relentless drive. If you're looking for someone with my skills and passion, I’m ready to connect and create something extraordinary."
  },
  {
    "id": "Blog-1",
    "title": "My Coding Odyssey: Part 1 - Sparks, Doubts, and Unexpected Turns",
    "snippet": "From post-exam uncertainties to early coding victories and the humbling challenges of C, join me on the initial chapters of my journey into the world of software engineering...",
    "longExcerpt": "This post recounts the very beginning of my coding adventure, starting April 2018. It covers the initial exploration of HTML, CSS, and JavaScript, the thrill of early learning, the daunting encounter with C's pointers, and the unexpected twists brought by the pandemic which led to an intensive period of self-learning in DSA, Python, and Java.",
    "date": "2024-01-16",
    "tags": ["Personal", "Journey", "Learning", "Coding"],
    "imageUrls": [
      "/images/blogs/blog-1/image1.png",
	  "/images/blogs/blog-1/image2.png",
	  "/images/blogs/blog-1/image3.png",
	  "/images/blogs/blog-1/image4.png"
    ],
    "estimatedReadingTime": "Est. 8 min read",
    "content": "## Doubts and Debugging: The Reality Check\\n\\nApril 2018. That’s when it all began, or rather, when a new kind of 'it' began. My SSC exams were over, and a vast expanse of vacation time stretched before me – a canvas of possibilities. But amidst that freedom, a nagging uncertainty about my career path lingered. I’ve always believed in self-improvement, so I decided to dip my toes into the world of coding. Why not, right? Free resources were abundant online, and 'freecodecamp' became my first digital dojo.\\n\\nHTML felt like a gentle introduction, and CSS followed suit. It’s funny how quickly those initial wins came. Within 15-20 days, I was navigating these languages with a confidence that surprised even me. That early thrill sparked a thought – maybe computer engineering was my calling. Then came a JavaScript course. The instructor made the basics seem almost too simple, and for a moment, I thought, 'This is it! I’ve found my thing.'\\n\\nBut the coding world has its gatekeepers, and for me, one of them was the C programming language. Recommendations led me to it, and initially, it was approachable. Then came arrays, pointers, dynamic memory allocation… The smooth sailing turned into choppy waters. Grasping these concepts felt like trying to catch smoke. Doubt, that unwelcome guest, started to creep in. Was I cut out for this? Yet, through that haze of confusion and frustration, a deeper truth began to emerge. The journey wasn't just about the easy victories; it was about weathering the storms. That initial turbulence, as it turned out, was just laying the groundwork for a more profound connection with coding. The odyssey had truly begun.\\n\\n## Embracing the College Coding Adventure\\n\\nThe vacation sun eventually set, and Mithibai College became the next arena for my computer science exploration. Opting for it as my vocational course, C++ was on the curriculum. Having already wrestled with C, C++ felt familiar, like meeting an old friend with a few new quirks. Pointers, my old nemeses, were still there, challenging my understanding. But this time, something clicked. The fog around arrays and dynamic memory allocation that had plagued me during my C studies started to lift. Those early struggles were transforming into stepping stones.\\n\\nPractical sessions were where the magic truly happened. Crafting star patterns, weaving intricate diamonds on the screen – these weren't just assignments; they were the exercises that sharpened my understanding of loops and conditional logic. My programming logic, once a hesitant flicker, ignited. The second year deepened this dive into C++, introducing object-oriented programming and file I/O. Then came microprocessors, specifically the 8085. Assembly language felt like deciphering an ancient script at first, but with perseverance and practice, it became a language I could speak.\\n\\nThose two years at Mithibai were transformative. Every challenge, every line of code, every small triumph sculpted my understanding and refined my logic. Little did I know, as I walked those college corridors, that each step was leading me closer to even more thrilling chapters in this coding odyssey.\\n\\n## Embracing the Unexpected Turns\\n\\nAs 2020 dawned and my time at Mithibai concluded, I was gearing up for HSC exams and MHT-CET, the gateway to engineering. Then, the world turned upside down. The COVID-19 pandemic threw everything into disarray. Exams were postponed, and lockdown boredom set in. With an uncertain future for exams, I decided to dive back into programming, a constant in a world of variables.\\n\\nThe internet became my roadmap: Learn a Language, Master Data Structures and Algorithms, Build Projects, Create a Resume, Apply for Jobs. With a C++ foundation, I tackled DSA. Finding good resources was a struggle until I stumbled upon Jenny's CS/IT YouTube channel. Her DSA playlist was a game-changer; complex data structures and algorithms started making sense.\\n\\nMy first projects were simple console applications, but each one was a step forward. With exam dates still up in the air, I decided to broaden my linguistic horizons. Python, with its rising demand, was next. Telusko's YouTube channel became my guide, and his Python playlist was phenomenal. The dynamically typed nature and pointer-less syntax were a refreshing change from C++. In about 10-12 days, I’d devoured the entire playlist. Java followed, and thanks to my C/C++ background, it felt surprisingly intuitive. Within a month, I had added two new languages to my toolkit.\\n\\nExams were finally scheduled for October 2020. Preparations were intense, and though they didn't go as perfectly as I'd hoped, the relief of completion was immense. Again, free time beckoned. My curiosity led me to databases and SQL. Freecodecamp, yet again, provided a fantastic 4-hour video that demystified SQL. This unexpected journey, full of twists and turns, was shaping into a narrative of resilience, adaptability, and an unyielding thirst for knowledge. The coding odyssey continued, richer and more complex than I could have ever imagined."
  }
]

    