[
  {
    "id": "Certificate 7",
    "title": "JavaScript",
    "issuingOrganisation": "Hackerrank",
    "date": "Issued Dec 2023",
    "description": "This certificate, issued by HackerRank, validates my skills in JavaScript programming. It showcases my ability to write clean, efficient code using core JavaScript concepts such as functions, closures, asynchronous programming, and DOM manipulation. It reflects my capability to build dynamic and interactive web applications.",
    "iconName": "Award",
    "imageUrl": "/images/certificates/javascript.png"
  },
  {
    "id": "Certificate 6",
    "title": "Software Engineer",
    "issuingOrganisation": "Hackerrank",
    "date": "Issued Nov 2023",
    "description": "This certificate, issued by HackerRank, validates my comprehensive skills as a Software Engineer. It covers a broad range of competencies including programming, problem-solving, algorithms, data structures, and software design principles. Successfully earning this certification reflects my readiness to tackle real-world software development challenges.",
    "iconName": "Award",
    "imageUrl": "/images/certificates/software-engineer.png"
  },
  {
    "id": "Certificate 5",
    "title": "Problem Solving",
    "issuingOrganisation": "Hackerrank",
    "date": "Issued Dec 2022",
    "description": "This certificate, issued by HackerRank, demonstrates my foundational skills in Data Structures and Algorithms. It highlights my ability to solve computational problems efficiently using techniques like arrays, strings, recursion, sorting, and searching. Earning this certificate reflects my logical thinking and problem-solving approach.",
    "iconName": "Award",
    "imageUrl": "/images/certificates/problem-solving.png"
  },
  {
    "id": "Certificate 4",
    "title": "SQL",
    "issuingOrganisation": "Hackerrank",
    "date": "Issued May 2022",
    "description": "This certificate, issued by HackerRank, demonstrates my proficiency in SQL and relational database management. It showcases my ability to write complex queries involving joins, subqueries, aggregations, and filtering. Earning this certification reflects my capability to extract and manipulate data effectively for real-world analytical and application needs.",
    "iconName": "Award",
    "imageUrl": "/images/certificates/sql.png"
  },
  {
    "id": "Certificate 3",
    "title": "Rest API",
    "issuingOrganisation": "Hackerrank",
    "date": "Issued Dec 2020",
    "description": "This certificate, issued by HackerRank, validates my understanding of RESTful API principles and best practices. It demonstrates my ability to design, consume, and test REST APIs using standard HTTP methods and status codes. Earning this certification reflects my skills in building scalable and maintainable web services.",
    "iconName": "Award",
    "imageUrl": "/images/certificates/rest-api.png"
  },
  {
    "id": "Certificate 2",
    "title": "Java",
    "issuingOrganisation": "Hackerrank",
    "date": "Issued Nov 2020",
    "description": "This certificate, issued by HackerRank, validates my proficiency in Java programming. It demonstrates my ability to solve real-world problems using object-oriented principles, data structures, and algorithms. Successfully earning this certification reflects my strong foundational knowledge and hands-on coding skills in Java.",
    "iconName": "Award",
    "imageUrl": "/images/certificates/java.png"
  },
  {
    "id": "Certificate 1",
    "title": "Python",
    "issuingOrganisation": "Hackerrank",
    "date": "Issued Nov 2020",
    "description": "This certificate, issued by HackerRank, verifies my proficiency in Python programming. It showcases my understanding of core Python concepts such as data types, control structures, functions, and built-in libraries. Successfully earning this certificate reflects my ability to write clean, efficient, and Pythonic code for solving real-world problems.",
    "iconName": "Award",
    "imageUrl": "/images/certificates/python.png"
  }
]
